##
# From brew bundle dump 
#
##

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "rcmdnk/file"
brew "composer"
brew "htop"
brew "neofetch"
brew "youtube-dl"
brew "rcmdnk/file/brew-file"

# Allows us to install App Store apps
brew "mas"

##
# Version control
#
##

# Git is a free and open source distributed version control system.
brew 'git'

##
# File synchronization
#
##

# Dropbox file sharing.
cask 'dropbox'

##
# Browsers
#
##

# Firefox web browser
cask 'firefox'

# Firefox developer edition, which features programming tools.
cask 'firefox-developer-edition'

# Brave web browser, which features security by default.
cask 'brave-browser'

# Google Chrome web browser
cask 'google-chrome'

# Google Chrome Canary web browser
cask 'google-chrome-canary'

##
# Chat
#
##

# Discord chat
cask 'discord'

# Slack chat client
cask 'slack'

##
# Editors
#
# We typically use command line editors (vim, emacs, etc.)
# and sometimes use GUI editors (atom, sublime, etc.)
##

# VSCode - Microsoft Visual Studio Code, VS Code
brew 'visual-studio-code'

##
# Multimedia
##

# Image libraries
brew 'libgphoto2'
brew 'libpng'
brew 'libtiff'


# FF MPEG for video
brew 'ffmpeg'
brew 'ffmpeg2theora'
brew 'ffmpegthumbnailer'

# alfredapp.com
cask 'alfred'

# Basecamp.com
cask 'basecamp'

# Spotify music player
cask 'spotify'

# teamviewer.com
cask 'teamviewer'

# Node.js is a JavaScript platform for building fast, scalable network app.
brew 'node'

# Python programming language, esp. for systems scripting.
brew 'python'
brew 'python3'

# Apple apps
mas "Xcode", id: 497799835
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas "Messenger", id: 1480068668
mas "HP Smart", id: 1474276998

# Do not seem to work
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456